; domain
(define (domain default)
  (:requirements :strips :typing)  ; Specifies the requirements: STRIPS, ADL, and typing.
  (:types
    agent workstation warehouse box supply - locatable  ; Object supply_types.
    location supply_type carrier - object
  )
  (:predicates
    (adjacent ?l1 ?l2 - location)       ; Indicates that ?l1 is adjacent to ?l2.
    (at ?o - locatable ?l - location)  ; Indicates that object ?o is at location ?l.
    (empty ?b - box)   ; Indicates that ?b, a box, is empty.
    (free_arms ?a - agent) ; Indicates that agent ?a has free arms (not carrying a box).
    (available ?b - box) ; Indicates that ?b, a box, is available to be carried.
    (box_carried_by ?b - box ?a - agent) ; Indicates that ?b, a box, is being carried by ?a, an agent.
    (contains ?b - box ?s - supply) ; Indicates that ?b, a box, contains ?s, a supply.
    (is ?s - supply ?t - supply_type) ; Indicates the supply_type ?t of a supply ?s.
    (has ?ws - workstation ?t - supply_type) ; Indicates that workstation ?ws requires a supply of supply_type ?t.
    (loaded_to ?s - supply ?ws - workstation) ; Indicates that supply ?s has been loaded to workstation ?ws.
  )
  
  ;; Actions
  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
      (adjacent ?from ?to)  ; Requires ?from to be adjacent to ?to.
      (at ?a ?from)  ; Agent ?a must be at the ?from location.
    )
    :effect (and 
      (at ?a ?to)  ; Agent ?a is now at ?to location.
      (not (at ?a ?from))  ; Agent ?a is no longer at ?from location.
    )
  )
  
  (:action load_box
    :parameters (?a - agent ?wh - warehouse ?b - box ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?wh ?l)  ; Warehouse ?wh must be at ?l location.
      (free_arms ?a)  ; Agent ?a must have free arms.
      (available ?b)  ; Box ?b must be available.
      (at ?b ?l)  ; Box ?b must be at ?l location.
    )
    :effect (and 
      (not (free_arms ?a))  ; Agent ?a no longer has free arms.
      (not (at ?b ?l))  ; Box ?b is no longer at ?l location.
      (not (available ?b))  ; Box ?b is no longer available.
      (box_carried_by ?b ?a)  ; Box ?b is now carried by agent ?a.
    )
  )
  
  (:action leave_box
    :parameters (?a - agent ?b - box ?wh - warehouse ?l - location)
    :precondition (and 
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?wh ?l)  ; Warehouse ?wh must be at ?l location.
    )
    :effect (and 
      (at ?b ?l)  ; Box ?b is now at ?l location.
      (free_arms ?a)  ; Agent ?a has free arms again.
      (available ?b)  ; Box ?b is now available.
      (not (box_carried_by ?b ?a))  ; Box ?b is no longer carried by agent ?a.
    )
  )

  (:action load_supply_to_workstation
    :parameters (?a - agent ?ws - workstation ?b - box ?s - supply ?l - location ?t - supply_type)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?ws ?l)  ; Workstation ?ws must be at ?l location.
      (contains ?b ?s)  ; Box ?b must contain supply ?s.
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
      (is ?s ?t)  ; Supply ?s must be of supply_type ?t.
    )
    :effect (and 
      (loaded_to ?s ?ws)  ; Supply ?s is now loaded to workstation ?ws.
      (not (contains ?b ?s))  ; Box ?b no longer contains supply ?s.
      (empty ?b)  ; Box ?b is now empty.
      (has ?ws ?t)  ; Workstation ?ws now has a supply of supply_type ?t.
    )
  )

  (:action fill_box
    :parameters (?a - agent ?wh - warehouse ?b - box ?s - supply ?l - location)
    :precondition (and 
      (at ?a ?l)  ; Agent ?a must be at ?l location.
      (at ?wh ?l)  ; Warehouse ?wh must be at ?l location.
      (at ?s ?l)  ; Supply ?s must be at ?l location.
      (empty ?b)  ; Box ?b must be empty.
      (box_carried_by ?b ?a)  ; Box ?b must be carried by agent ?a.
    )
    :effect (and 
      (not (empty ?b))  ; Box ?b is no longer empty.
      (contains ?b ?s)  ; Box ?b now contains supply ?s.
      (not (at ?s ?l))  ; Supply ?s is no longer at ?l location.
    )
  )
)

; problem
;; problem file: problem_1.pddl
(define (problem default)
  (:domain default)
  (:objects l1_4 l2_0 l4_0 l1_3 l1_2 l3_2 l2_2 l4_2 l3_0 l0_3 l4_4 l1_1 l2_3 l0_4 l1_0 l0_2 l3_3 l4_3 l2_4 l4_1 l0_1 l0_0 l3_1 l2_1 l3_4 - location agent_0 - agent supply_3 supply_0 supply_1 supply_7 supply_6 supply_4 supply_2 supply_5 - supply box_6 box_0 box_4 box_5 box_1 box_7 box_2 box_9 box_8 box_3 - box workstation_0 workstation_1 - workstation warehouse_0 - warehouse tool valve gear bolt - supply_type )
  (:init (adjacent l1_4 l2_4) (empty box_3) (adjacent l2_1 l2_2) (adjacent l3_1 l3_0) (at supply_1 l4_2) (is supply_1 valve) (adjacent l0_3 l1_3) (adjacent l2_0 l2_1) (adjacent l4_2 l3_2) (adjacent l0_0 l0_1) (available box_5) (adjacent l2_2 l2_1) (at supply_2 l4_2) (at supply_5 l4_2) (available box_8) (adjacent l3_3 l3_4) (adjacent l4_3 l3_3) (adjacent l1_3 l0_3) (adjacent l1_2 l0_2) (adjacent l2_4 l3_4) (adjacent l4_0 l4_1) (empty box_9) (adjacent l2_4 l2_3) (adjacent l3_3 l2_3) (adjacent l4_3 l4_4) (adjacent l0_3 l0_4) (adjacent l4_3 l4_2) (adjacent l4_0 l3_0) (adjacent l1_0 l2_0) (adjacent l1_3 l2_3) (adjacent l2_3 l2_2) (available box_1) (adjacent l3_3 l3_2) (at supply_4 l4_2) (loaded_to supply_0 workstation_1) (adjacent l4_1 l3_1) (empty box_7) (adjacent l3_3 l4_3) (is supply_2 bolt) (adjacent l0_2 l0_3) (empty box_6) (available box_0) (adjacent l1_1 l1_2) (empty box_2) (adjacent l1_2 l1_1) (empty box_0) (at supply_6 l4_2) (at box_2 l4_2) (loaded_to supply_7 workstation_0) (available box_9) (adjacent l0_4 l0_3) (adjacent l1_1 l1_0) (adjacent l3_1 l2_1) (adjacent l3_2 l3_1) (adjacent l0_1 l0_0) (adjacent l4_1 l4_2) (at box_0 l4_2) (adjacent l2_0 l3_0) (adjacent l2_4 l1_4) (at workstation_0 l0_2) (at box_3 l4_2) (empty box_5) (at box_6 l4_2) (adjacent l0_3 l0_2) (is supply_0 valve) (adjacent l1_3 l1_4) (adjacent l2_1 l3_1) (adjacent l3_2 l3_3) (available box_2) (adjacent l2_3 l1_3) (adjacent l3_4 l3_3) (at workstation_1 l3_1) (empty box_8) (available box_4) (adjacent l0_1 l1_1) (adjacent l2_3 l3_3) (adjacent l4_4 l3_4) (at supply_7 l4_2) (adjacent l3_1 l4_1) (adjacent l1_1 l2_1) (adjacent l0_4 l1_4) (at box_7 l4_2) (loaded_to supply_2 workstation_1) (adjacent l2_2 l2_3) (loaded_to supply_3 workstation_0) (free_arms agent_0) (adjacent l3_4 l2_4) (adjacent l3_2 l2_2) (adjacent l2_3 l2_4) (at box_5 l4_2) (adjacent l1_3 l1_2) (adjacent l2_2 l1_2) (empty box_4) (adjacent l3_2 l4_2) (at box_4 l4_2) (adjacent l0_2 l1_2) (adjacent l1_0 l1_1) (adjacent l1_2 l1_3) (adjacent l3_0 l2_0) (adjacent l0_0 l1_0) (empty box_1) (adjacent l2_2 l3_2) (adjacent l1_4 l0_4) (adjacent l4_1 l4_0) (adjacent l0_2 l0_1) (adjacent l4_2 l4_1) (adjacent l4_2 l4_3) (adjacent l2_1 l1_1) (loaded_to supply_1 workstation_0) (available box_6) (adjacent l1_4 l1_3) (is supply_3 bolt) (is supply_5 tool) (available box_7) (is supply_4 tool) (adjacent l2_0 l1_0) (adjacent l2_1 l2_0) (adjacent l1_0 l0_0) (at box_8 l4_2) (adjacent l1_2 l2_2) (adjacent l3_0 l4_0) (at warehouse_0 l4_2) (at box_1 l4_2) (at box_9 l4_2) (adjacent l4_4 l4_3) (is supply_6 gear) (adjacent l3_4 l4_4) (is supply_7 gear) (at supply_0 l4_2) (adjacent l3_1 l3_2) (available box_3) (at supply_3 l4_2) (adjacent l3_0 l3_1) (adjacent l0_1 l0_2) (at agent_0 l4_2) (loaded_to supply_5 workstation_0) (adjacent l1_1 l0_1))
  (:goal (and (has workstation_1 tool) (has workstation_1 gear)))
)

; plan
1. (load_box agent_0 warehouse_0 box_3 l4_2)
   deleted: (free_arms agent_0) (at box_3 l4_2) (available box_3)
   added: (box_carried_by box_3 agent_0)
   goals met: 0 of 2
2. (fill_box agent_0 warehouse_0 box_3 supply_5 l4_2)
   deleted: (empty box_3) (at supply_5 l4_2)
   added: (contains box_3 supply_5)
   goals met: 0 of 2
3. (move agent_0 l4_2 l3_2)
   deleted: (at agent_0 l4_2)
   added: (at agent_0 l3_2)
   goals met: 0 of 2
4. (move agent_0 l3_2 l3_1)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_1)
   goals met: 0 of 2
5. (load_supply_to_workstation agent_0 workstation_1 box_3 supply_5 l3_1 tool)
   deleted: (contains box_3 supply_5)
   added: (loaded_to supply_5 workstation_1) (empty box_3) (has workstation_1 tool)
   goals met: 1 of 2
6. (move agent_0 l3_1 l3_2)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_2)
   goals met: 1 of 2
7. (move agent_0 l3_2 l4_2)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l4_2)
   goals met: 1 of 2
8. (fill_box agent_0 warehouse_0 box_3 supply_6 l4_2)
   deleted: (empty box_3) (at supply_6 l4_2)
   added: (contains box_3 supply_6)
   goals met: 1 of 2
9. (move agent_0 l4_2 l3_2)
   deleted: (at agent_0 l4_2)
   added: (at agent_0 l3_2)
   goals met: 1 of 2
10. (move agent_0 l3_2 l3_1)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_1)
   goals met: 1 of 2
11. (load_supply_to_workstation agent_0 workstation_1 box_3 supply_6 l3_1 gear)
   deleted: (contains box_3 supply_6)
   added: (loaded_to supply_6 workstation_1) (empty box_3) (has workstation_1 gear)
   goals met: 2 of 2
